In [1]:
#조건으로 검색하기 
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df = pd.DataFrame(np.random.rand(5,2), columns=["A","B"])
df

          A         B
0  0.985430  0.143135
1  0.315491  0.362822
2  0.830392  0.438585
3  0.059911  0.009285
4  0.603459  0.463747

In [3]:
print(df["A"])
print()
print(df["A"] < 0.5)
print()

0    0.985430
1    0.315491
2    0.830392
3    0.059911
4    0.603459
Name: A, dtype: float64

0    False
1     True
2    False
3     True
4    False
Name: A, dtype: bool

In [4]:
#조건으로 검색 

print(df[(df["A"] < 0.5) & (df["B"] > 0.3)])  #1번

c = (df["A"] < 0.5) & (df["B"] > 0.3) #2번
print(df[c])

print(df.query("A < 0.5 and B > 0.3")) #3번

          A         B
1  0.315491  0.362822
          A         B
1  0.315491  0.362822
          A         B
1  0.315491  0.362822

In [5]:
#문자열 조건 

data = {
	'Animal' : ['Dog','Cat','Cat','Pig','Cat'],
	'Name' : ['Happy','Sam','Toby','Mini','Rocky']
}

In [6]:
data

{'Animal': ['Dog', 'Cat', 'Cat', 'Pig', 'Cat'],
 'Name': ['Happy', 'Sam', 'Toby', 'Mini', 'Rocky']}

In [7]:
df = pd.DataFrame(data)
df

  Animal   Name
0    Dog  Happy
1    Cat    Sam
2    Cat   Toby
3    Pig   Mini
4    Cat  Rocky

In [8]:
df["Animal"].str.contains("Cat")

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

In [9]:
df[df["Animal"].str.contains("Cat")]

  Animal   Name
1    Cat    Sam
2    Cat   Toby
4    Cat  Rocky

In [10]:
df['Animal']

0    Dog
1    Cat
2    Cat
3    Pig
4    Cat
Name: Animal, dtype: object

In [11]:
df["Animal"].str.contains("cat", case=False) #case= 대소문자 상관없음

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

In [12]:
df.Animal.str.match("cat",case=False)

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

In [13]:
#함수로 데이터 처리하기 
#apply() : 함수를 받아서 적용 

df = pd.DataFrame(np.arange(5), columns=['Num'])

def square(x):
    return x**2
print(df)
print()
print(df["Num"])

df["Num"].apply(square)

   Num
0    0
1    1
2    2
3    3
4    4

0    0
1    1
2    2
3    3
4    4
Name: Num, dtype: int32

0     0
1     1
2     4
3     9
4    16
Name: Num, dtype: int64

In [14]:
#새 열 생성 >> 기존 데이터 프레임에 삽입
df['square'] = df["Num"].apply(square)
print(df)

   Num  square
0    0       0
1    1       1
2    2       4
3    3       9
4    4      16

In [15]:
df["Square_lambda"] = df.Num.apply(lambda x: x**2)
print(df)

   Num  square  Square_lambda
0    0       0              0
1    1       1              1
2    2       4              4
3    3       9              9
4    4      16             16

In [16]:
#함수로 데이터 처리하기 

df = pd.DataFrame(columns=['phone'])
df.loc[0] = "010-1234-5678"
df.loc[1] = "공일공-일이삼사-오육칠팔"
df.loc[2] = "010.1234.오육칠팔"
df.loc[3] = "공1공-1234-5육7팔"
df["pp"] = ''

In [17]:
df

           phone pp
0  010-1234-5678
1  공일공-일이삼사-오육칠팔
2  010.1234.오육칠팔
3  공1공-1234-5육7팔

In [18]:
def gpp(phone):
    m_dict = {
		"공" : "0",
		"일" : "1",
		"이" : "2",
		"삼" : "3",
		"사" : "4",
		"오" : "5",
		"육" : "6",
		"칠" : "7",
		"팔" : "8",
		"-"  : "",
		"."  : "",
}
    
    for key, value in m_dict.items():
    	phone = phone.replace(key, value)
    return phone

In [19]:
df["preprocess_phone"] = df["phone"].apply(
gpp)

In [20]:
df

           phone pp preprocess_phone
0  010-1234-5678         01012345678
1  공일공-일이삼사-오육칠팔         01012345678
2  010.1234.오육칠팔         01012345678
3  공1공-1234-5육7팔         01012345678

In [21]:
data = {
	'Sex' : ['Male','Male','Female','Female','Male']
}

In [22]:
df = pd.DataFrame(data)
df

      Sex
0    Male
1    Male
2  Female
3  Female
4    Male

In [23]:
df2 =df.Sex.replace({"Male": 0, "Female": 1})
df3 =df.Sex.replace({"Male": 0, "Female": 1}, inplace=True)

In [24]:
df

   Sex
0    0
1    0
2    1
3    1
4    0

In [25]:
#그룹으로 묶기 
#조건부로 집계하고 싶은 경우 

df =pd.DataFrame({'key': ['A','B','C','A','B','C'],
              'data' : range(6)})
print(df)

df.groupby('key')

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [26]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [27]:
df.groupby(['key','data']).sum()

Empty DataFrame
Columns: []
Index: [(A, 0), (A, 3), (B, 1), (B, 4), (C, 2), (C, 5)]

In [32]:
#aggregate
#groupby를 통해서 집계를 한번에 계산하는 방법 

df = pd.DataFrame({"data1": range(6), 
                   "data2": [4,4,6,0,6,1],
                   "key" : ["A","B","C","A","B","C"]})
df

   data1  data2 key
0      0      4   A
1      1      4   B
2      2      6   C
3      3      0   A
4      4      6   B
5      5      1   C

In [33]:
df.groupby('key').aggregate(['min', np.median, max])

C:\Users\Master\AppData\Local\Temp\ipykernel_7604\960770304.py:1: FutureWarning: The provided callable <function median at 0x000001894A0F0B80> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  df.groupby('key').aggregate(['min', np.median, max])
C:\Users\Master\AppData\Local\Temp\ipykernel_7604\960770304.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df.groupby('key').aggregate(['min', np.median, max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     0    2.0   4
B       1    2.5   4     4    5.0   6
C       2    3.5   5     1    3.5   6

In [34]:
df.groupby('key').aggregate({'data1': 'min', 'data2': np.sum})

C:\Users\Master\AppData\Local\Temp\ipykernel_7604\3756916842.py:1: FutureWarning: The provided callable <function sum at 0x0000018949F2FF60> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  df.groupby('key').aggregate({'data1': 'min', 'data2': np.sum})

     data1  data2
key
A        0      4
B        1     10
C        2      7

In [36]:
#filter 
#groupby를 통해서 그룹 속성을 기준으로 데이터 필터링

def filter_by_mean(x):
    return x['data2'].mean() > 3
print(df.groupby('key').mean())
print(df.groupby('key').filter(filter_by_mean))

     data1  data2
key
A      1.5    2.0
B      2.5    5.0
C      3.5    3.5
   data1  data2 key
1      1      4   B
2      2      6   C
4      4      6   B
5      5      1   C

In [38]:
#apply
#groupby를 통해서 묶인 데이터에 함수 적용
print(df)
df.groupby('key').apply(lambda x : x.max() - x.min())

   data1  data2 key
0      0      4   A
1      1      4   B
2      2      6   C
3      3      0   A
4      4      6   B
5      5      1   C

     data1  data2
key
A        3      4
B        3      2
C        3      5

In [42]:
#get_group
#groupby로 묶인 데이터에서 key값으로 데이터를 가져올 수 있다.




df.groupby('key').get_group("A")

   data1  data2 key
0      0      4   A
3      3      0   A

In [50]:
#MultiIndex
#인덱스를 계층적으로 만들 수 있다 .

df = pd.DataFrame(
	np.random.randn(4,2),
	index = [['A','A','B','B'], [1,2,1,2,]],
	columns= ['data1','data2']
)
df['data1']

A  1    0.937513
   2    0.661980
B  1    0.169109
   2    0.175987
Name: data1, dtype: float64

In [53]:
#열 인덱스도 계층적으로 만들 수 있다.

df = pd.DataFrame(
np.random.randn(4, 4),
columns=[["A", "A", "B", "B"], ["1", "2", "1", "2"]]
)
df

          A                   B
          1         2         1         2
0  1.359230 -0.124836 -1.847443 -0.583343
1 -0.913276  0.062855  0.733898  1.952546
2  1.193715  1.094101 -0.451015 -1.330183
3  0.279294  0.705050  1.132311 -0.649420

In [55]:
df["A"]
df["A"]["1"]

0    1.359230
1   -0.913276
2    1.193715
3    0.279294
Name: 1, dtype: float64

In [74]:
#pivot_table 

'''데이터에서 필요한 자료만 뽑아서 새롭게 요약,
분석 할 수 있는 기능 엑셀에서의 피봇 테이블과 같다
• Index : 행 인덱스로 들어갈 key
• Column : 열 인덱스로 라벨링될 값
• Value : 분석할 데이터 
'''
data = {
    "날짜": ["2020-01-01", "2020-01-01", "2020-01-01", "2020-01-02", "2020-01-02", "2020-01-02"],
    "카테고리": ["과일", "채소", "채소", "과일", "과일", "채소"],
    "수량": [10, 15, 5, 20, 10, 5],
    "가격" : [5000,3000,10000,25000,2300,4000]
}


pd.DataFrame(data)

           날짜 카테고리  수량     가격
0  2020-01-01   과일  10   5000
1  2020-01-01   채소  15   3000
2  2020-01-01   채소   5  10000
3  2020-01-02   과일  20  25000
4  2020-01-02   과일  10   2300
5  2020-01-02   채소   5   4000

In [75]:
df = pd.DataFrame(data)

df.pivot_table(
    index = "날짜",
    columns = "카테고리",
    values = "수량",
    aggfunc = "sum"
)

카테고리        과일  채소
날짜
2020-01-01  10  20
2020-01-02  30   5

In [77]:
df.pivot_table(
    index = "날짜",
    columns = "카테고리",
    values = ["수량","가격"],
    aggfunc = np.sum
)

C:\Users\Master\AppData\Local\Temp\ipykernel_7604\111042847.py:1: FutureWarning: The provided callable <function sum at 0x0000018949F2FF60> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  df.pivot_table(

               가격         수량
카테고리           과일     채소  과일  채소
날짜
2020-01-01   5000  13000  10  20
2020-01-02  27300   4000  30   5